# 1. Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

a = 100
b = 'Text here'
c = 100.0
d = True

print('a = ', a, ' тип', type(a))
print('b = ', b, ' тип', type(b))
print('c = ', c, ' тип', type(c))
print('d = ', d, ' тип', type(d))


e = input('Введите число: ')
f = input('Введите еще число: ')
g = input('Введите текст: ')

print('e = ', e, ' тип', type(e))
print('f = ', f, ' тип', type(f))
print('g = ', g, ' тип', type(g))

